Revit.Elements.Views.Sheet.ByNameNumberTitleBlockAndViews(System.String,System.String,Revit.Elements.FamilyType,Revit.Elements.Views.View[])
Create a Revit Sheet by the sheet name, number, a title block FamilyType, and a collection of views.  This method will automatically
pack the views onto the sheet.
sheetName: Sheet Name as String.
sheetNumber: Sheet Number as String.
titleBlockFamilyType: Titleblock that will be assigned to created Sheet.
views: Views to be placed on Sheet.
Returns:

Revit.Elements.Views.Sheet.ByNameNumberTitleBlockAndView(System.String,System.String,Revit.Elements.FamilyType,Revit.Elements.Views.View)
Create a Revit Sheet by the sheet name, number, a title block FamilyType, and a collection of views.  This method will automatically
pack the view onto the sheet.
sheetName: Sheet Name as String.
sheetNumber: Sheet Number as String.
titleBlockFamilyType: Titleblock that will be assigned to created Sheet.
view: Views to be placed on Sheet.
Returns: